In [ ]:
import pandas as pd

df = pd.read_csv('titanic.csv')

,survived,pclass,name,sex,age,fare,sibsp,parch
587,1,1,"Lesurer, Mr. Gustave J",male,35.0,512.3292,0,0
589,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,262.3750,2,2
275,0,2,"Collander, Mr. Erik Gustaf",male,28.0,13.0000,0,0
584,0,2,"Troupiansky, Mr. Moses Aaron",male,23.0,13.0000,0,0
291,0,3,"Asim, Mr. Adola",male,35.0,7.0500,0,0

1. How big is Data ?

In [5]:
df.shape

(714, 8)

2. How does the data look like ?

In [6]:
df.head()

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0

In [7]:
df.sample()

,survived,pclass,name,sex,age,fare,sibsp,parch
580,0,3,"Ilmakangas, Miss. Pieta Sofia",female,25.0,7.925,1,0

3. What is Data Types of columns ?

In [8]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  714 non-null    int64
 1   pclass    714 non-null    int64
 2   name      714 non-null    str
 3   sex       714 non-null    str
 4   age       714 non-null    float64
 5   fare      714 non-null    float64
 6   sibsp     714 non-null    int64
 7   parch     714 non-null    int64
dtypes: float64(2), int64(4), str(2)
memory usage: 44.8 KB

4. Are there any missing values ?

In [9]:
df.isnull().sum()

survived    0
pclass      0
name        0
sex         0
age         0
fare        0
sibsp       0
parch       0
dtype: int64

5. How does the data look Mathematically ?

In [10]:
df.describe()

         survived      pclass         age        fare       sibsp       parch
count  714.000000  714.000000  714.000000  714.000000  714.000000  714.000000
mean     0.406162    2.236695   29.699118   34.694514    0.512605    0.431373
std      0.491460    0.838250   14.526497   52.918930    0.929783    0.853289
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   20.125000    8.050000    0.000000    0.000000
50%      0.000000    2.000000   28.000000   15.741700    0.000000    0.000000
75%      1.000000    3.000000   38.000000   33.375000    1.000000    1.000000
max      1.000000    3.000000   80.000000  512.329200    5.000000    6.000000

6. Are there duplicate values ?

In [12]:
df.duplicated().sum()

np.int64(0)

7. How is the correlation between cols ?

In [ ]:
df.corr(numeric_only=True)

survived    1.000000
pclass     -0.359653
age        -0.077221
fare        0.268189
sibsp      -0.017358
parch       0.093317
Name: survived, dtype: float64

In [17]:
df.corr(numeric_only=True)['survived']

survived    1.000000
pclass     -0.359653
age        -0.077221
fare        0.268189
sibsp      -0.017358
parch       0.093317
Name: survived, dtype: float64